simulations/FlowPastCylinder/cases/case2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.4.0 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	location "system";
	object fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
	p
	{
	solver PCG;
	preconditioner DIC;
	tolerance 1e-06;
	relTol 0;
	}
	
	pFinal
	{
	   $p;
	   relTol 0;
	}

	U
	{
		solver PBiCG;
		preconditioner DILU;
		tolerance 1e-05;
		relTol 0;
	}
}

PISO
{
	nCorrectors 2;
	nNonOrthogonalCorrectors 3;
	pRefCell 0;
	pRefValue 0;
}
// ************************************************************************* //